const changelog = [
  {
    date: new Date(2024, 2, 31),
    changes: [
      {
        page: "Журнал изменений",
        description: "Создан на flex с рендером из js-файла",
      },
    ],
  },
  {
    date: new Date(2024, 3, 1),
    changes: [
      {
        page: "Журнал изменений",
        description: "Подправлена вёрстка",
      },
      {
        page: "Раздел о себе",
        description: "Добавлена анимация выползания навыков из-за экрана",
      },
    ],
  },
  {
    date: new Date(2024, 3, 6),
    changes: [
      {
        page: "Проекты",
        description: "Изменён текст, добавлена анимация",
      },
      {
        page: "Раздел о себе",
        description: "Подправлена анимация",
      },
      {
        page: "Общее",
        description: "Добавлена кнопка перехода на предыдущую страницу",
      },
    ],
  },
  {
    date: new Date(2024, 3, 8),
    changes: [
      {
        page: "Обучение",
        description: "Начал углубляться в вёрстку на HTMLAcademy",
      },
    ],
  },
  {
    date: new Date(2024, 3, 12),
    changes: [
      {
        page: "Тестовое",
        description:
          "Сделал простой layout с последовательной анимацией. Использовал grid и js-анимацию",
        link: "https://test-first-flame.vercel.app/",
      },
    ],
  },
  {
    date: new Date(2024, 3, 16),
    changes: [
      {
        page: "Обучение",
        description:
          "Начал изучать TypeScript, решил первую задачу по TypeScript на Leetcode",
      },
      {
        page: "RSS",
        description: "Выялены косяки с вёрсткой, добавлены в задачи",
      },
    ],
  },
  {
    date: new Date(2024, 3, 17),
    changes: [
      {
        page: "Журнал изменений",
        description:
          "Внесены свежие данные, выявлен один баг, добавлен в задачи",
      },
      {
        page: "RSS",
        description:
          "Исправлена вёрстка. Расширен блок с новостями, убрано подчёркивание блока при наведении на новость, исправлено неравномерное смещение описания исправления при уменьшении ширины экрана",
      },
    ],
  },
  {
    date: new Date(2024, 3, 20),
    changes: [
      {
        page: "Резюме",
        description:
          "Обновил резюме. Сделал его более читаемым для рекрутеров",
      },
      {
        page: "Первое тестовое",
        description:
          "Немного подправлена вёрстка, чтобы анимация не скакала",
      },
      {
        page: "Весь сайт",
        description:
          "Обновил цвета элементов, поменял шрифт",
      },
    ],
  },
  {
    date: new Date(2024, 3, 25),
    changes: [
      {
        page: "Тестовое",
        description:
          "Сделал второе тестовое, где надо получить данные с сервера, сделать по ним карточки с возможностью сортировки и удаления на фронтенд части, а также отображением этих данных на карте.",
        link: "https://test-glonassgps.vercel.app/",
      },
    ],
  },
];

export default changelog;
